## Table of Contents 

### 01. Importing libraries
### 02. Importing data 
### 03. Data Wrangling 
### 04. Merging Databases
### 05. Exporting Data

# 01. Importing libaries

In [2]:
#import libaries
import pandas as pd
import numpy as np
import os

# 02. Importing data

In [5]:
#creating a path
path = r'C:\Users\canam\Achievement 4\Instacart Basket Analysis'

In [7]:
#importing customers data set
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [9]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
df_customers.shape

(206209, 10)

# 03. Data Wrangling

In [14]:
#making sure that the column names are consistent
#change First Name into first_name 
#change Surnam into last_name
#change Gender into gender
#change STATE into state
#change Age into age 
#change n_dependants to number_of_dependants
#fam_status into marital_status

In [16]:
df_customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [18]:
df_customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [20]:
df_customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [22]:
df_customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [24]:
df_customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [26]:
df_customers.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [28]:
df_customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [30]:
#checking to see that the column names have been changed 
df_customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

Of the columns, I think date_joined contibutes least to the analysis.  However, I am not 100% that it won't be used in future analyses, so I am leaving it in the dataframe.

In [33]:
#checking the data types 
df_customers.dtypes

user_id                  int64
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
marital_status          object
income                   int64
dtype: object

In [35]:
#user id should be a string type
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [37]:
#checking that it has been changed
(df_customers.dtypes['user_id'])

dtype('O')

In [39]:
#checking if there are any mixed data types 
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

first_name

In [41]:
#changing first_name data type to string
df_customers['first_name'] = df_customers['first_name'].astype('str')

In [89]:
#checking to see that first_name has been converted to string 
(df_customers.dtypes['first_name'])

dtype('O')

In [43]:
#mixed data types have been addressed and all data types are appropriate

In [45]:
#checking for missing values
df_customers.isnull().sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
marital_status          0
income                  0
dtype: int64

In [47]:
#no missing values

In [49]:
#checking for duplicates
df_dups = df_customers[df_customers.duplicated()]

In [51]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, marital_status, income]
Index: []

In [53]:
#no duplicate values

In [55]:
#checking the descriptive statistics of the dataframe 
df_customers.describe()

                 age  number_of_dependants         income
count  206209.000000         206209.000000  206209.000000
mean       49.501646              1.499823   94632.852548
std        18.480962              1.118433   42473.786988
min        18.000000              0.000000   25903.000000
25%        33.000000              0.000000   59874.000000
50%        49.000000              1.000000   93547.000000
75%        66.000000              3.000000  124244.000000
max        81.000000              3.000000  593901.000000

In [57]:
#everything seems to look normal

In [59]:
#importing the final ords_prods data frame
df_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_derived_aggregated.pkl'))

In [61]:
df_ords_prods.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_spent,spending_flag,median_days_since_last_order,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regularly busy,Most Orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regularly busy,Average Orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Busiest days,Average Orders,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,Slowest days,Most Orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,Slowest days,Average Orders,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [63]:
df_ords_prods.shape

(32404859, 25)

In [65]:
#shape of dataframe is the same as when it was exported

# 04. Merging databases

In [68]:
#user id is a column in both databases
#checking to see if it is the same data type in both databases
(df_ords_prods.dtypes['user_id'])

dtype('int64')

In [70]:
#user id is an integer in the df_ords_prods
#it needs to be changed into a string
df_ords_prods['user_id'] = df_ords_prods['user_id'].astype('str')

In [71]:
#checking that it has been changed
(df_ords_prods.dtypes['user_id'])

dtype('O')

In [72]:
df_ords_prods.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_last_order', 'first_order',
       'add_to_cart_order', 'reordered', '_merge', 'price_range_loc',
       'busiest_day', 'busiest_days', 'busiest_period_of_day', 'max_order',
       'loyalty_flag', 'average_spent', 'spending_flag',
       'median_days_since_last_order', 'frequency_flag'],
      dtype='object')

In [73]:
#dropping the _merge column from the database because we will be doing another merge
df_ords_prods = df_ords_prods.drop(columns = ['_merge'])

In [74]:
#merging the ords_prods_database
df_ords_prods_cust_merge = df_ords_prods.merge(df_customers, on = 'user_id', indicator = True)

In [80]:
#checking the output

In [82]:
df_ords_prods_cust_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,first_name,last_name,gender,state,age,date_joined,number_of_dependants,marital_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both

In [84]:
df_ords_prods_cust_merge.shape

(32404859, 34)

# 05. Exporting Data

In [87]:
df_ords_prods_cust_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_cust_merge.pkl'))